InformationRegisters/ОтметкиВыполненияДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтметкиВыполненияДействий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрохождениеМедосмотра</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтметкаВыполненияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДействияМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрохождениеМедОсмотра</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПрохождениеМедосмотра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктивностьЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтметкиВыполненияДействий/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура УстановитьАктивностьПоРегистратору.
//
// Параметры:
//  Регистратор	 - ДокументСсылка	 - документ.
//  Значение	 - Булево			 - значение выполнения.
//
Процедура УстановитьАктивностьПоРегистратору(Регистратор, Значение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтметкиВыполненияДействий.Период,
	               |	ОтметкиВыполненияДействий.Действие,
	               |	ОтметкиВыполненияДействий.ПрохождениеМедОсмотра,
	               |	ОтметкиВыполненияДействий.Выполнено,
	               |	ОтметкиВыполненияДействий.ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.ОтметкиВыполненияДействий КАК ОтметкиВыполненияДействий
	               |ГДЕ
	               |	ОтметкиВыполненияДействий.ДокументРегистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", Регистратор);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Набор = РегистрыСведений.ОтметкиВыполненияДействий.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.Действие.Установить(Выборка.Действие);
		Набор.Отбор.ПрохождениеМедОсмотра.Установить(Выборка.ПрохождениеМедОсмотра);
		Набор.Прочитать();
		
		Если Набор.Выбран() Тогда
			Запись = Набор[0];
			Запись.АктивностьЗаписи = НЕ Значение;
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
